README.org
#+OPTIONS: toc:t h:4 num:nil
#+PROPERTY: header-args :results silent

* My emacs configuration

Cumulated over years, all the elisp configuration lines I found interesting for
my workflow in their tidiest form I could come up with, both for Windows and
Linux.

* Usage
Simplest way: save your current configuration and clone this repository in its place.
#+BEGIN_SRC sh
mv ~/.emacs.d ~/.emacs.d.bak
mv ~/.emacs ~/.emacs.bak
git clone https://github.com/jackjackk/emacs-conf.git ~/.emacs.d
#+END_SRC
Other strategies to merge an existing directory with a git repo can be found [[http://stackoverflow.com/questions/5377960/whats-the-best-practice-to-git-clone-into-an-existing-folder][here]]. In particular:
#+BEGIN_SRC sh
git clone https://github.com/jackjackk/emacs-conf.git ~/.emacs.d/.git --mirror --config core.bare=false
#+END_SRC
will transform your emacs conf dir in a working copy of this repository.

* Description
** The main file (~init.el~)
:PROPERTIES:
:tangle:   init.el
:END:
All conf code is self-contained in =~/.emacs.d= dir. If no =~/.emacs= file is
found, emacs will use =~/.emacs.d/init.el=. This in turn call other files in a modular fashion.
First, customize built-in features.
#+BEGIN_SRC elisp
(add-to-list 'load-path "~/.emacs.d/")

(load-library "init-startup.el")
(load-library "init-general.el")
(load-library "init-visual.el")
(load-library "init-text.el")
(load-library "init-os.el")
(load-library "init-python.el")
(load-library "init-latex.el")
#+END_SRC

Then add extra packages, either from repositories or from local subfolders.
#+BEGIN_SRC elisp
;; * Extra packages
;; ** from repositories
(setq package-list '(helm
                     yasnippet
                     expand-region
                     multiple-cursors
                     org
;                     org-redmine
                     org-pomodoro
                     org2blog
;                     websocket
;                     ein
                     bm
                     zotelo
))
;; ** from local subfolders 
(setq other-package-list '(gams
                           matlab))
(load-library "init-packages.el")
#+END_SRC
Make sure you *select just the packages you are interested in*, otherwise be aware that all missing packages on repositories will be downloaded and installed on startup, which requires time + internet bandwidth.
** Customizing built-in features
*** Startup (~init-startup.el~)
:PROPERTIES:
:tangle:   init-startup.el
:END:

Allow Emacs to accept client processes (e.g. an external IPython console with ~emacsclient~ as editor).
#+BEGIN_SRC elisp
(server-start)
#+END_SRC

Remove startup messages and clean the scratch buffer.
#+BEGIN_SRC elisp
(setq inhibit-startup-message t
      inhibit-splash-screen t
      initial-scratch-message nil)
#+END_SRC
*** General (~init-general.el~)
:PROPERTIES:
:tangle:   init-general.el
:END:

One-character yes-no answer.
#+BEGIN_SRC elisp
(defalias 'yes-or-no-p 'y-or-n-p)
#+END_SRC

Save all tempfiles in ~$TMPDIR/emacs$UID/~.
#+BEGIN_SRC elisp
(defconst emacs-tmp-dir (format "%s%s%s/" temporary-file-directory "emacs" (user-uid)))
(setq backup-directory-alist
    `((".*" . ,emacs-tmp-dir)))
(setq auto-save-file-name-transforms
    `((".*" ,emacs-tmp-dir t)))
(setq auto-save-list-file-prefix
    emacs-tmp-dir)
#+END_SRC

Distinguish ~C-i~ and ~tab~.
#+BEGIN_SRC elisp
(setq local-function-key-map (delq '(kp-tab . [9]) local-function-key-map))
#+END_SRC

Enable automatic saving of the desktop (i.e. the buffers, their file names,
major modes, buffer positions, ...) when you exit Emacs, and automatic
restoration of the last saved desktop when Emacs starts
#+BEGIN_SRC elisp
(desktop-save-mode 1)
#+END_SRC

Set convenient Dired switches.
#+BEGIN_SRC elisp
(setq dired-listing-switches "-alh")
#+END_SRC

**** Key-bindings
| ~C-S-s~     | Save all files at once.                         |
| ~f5~        | Revert buffer w/o confirmation.                 |
| ~C-tab~     | Switch focus to other window.                   |
| ~C-S-tab~   | Switch focus to other window in reverse.        |
| ~C-0~       | Delete current window and switches to previous. |
| ~C-1~       | Expand current window.                          |
| ~C-S-left~  | Shrink window horizontally.                     |
| ~C-S-right~ | Enlarge window horizontally.                    |
| ~C-S-up~    | Shrink window vertically.                       |
| ~C-S-down~  | Enlarge window vertically.                      |

#+BEGIN_SRC elisp
(defun save-all () (interactive) (save-some-buffers t))
(global-set-key (kbd "C-S-s") 'save-all)

(defun revert-buffer-no-confirm ()
    "Revert buffer without confirmation."
    (interactive) (revert-buffer t t))
(global-set-key (kbd "<f5>") 'revert-buffer-no-confirm)

(global-set-key (kbd "<C-tab>") 'other-window)

(fset 'other-window-reverse
   (lambda (&optional arg) "Keyboard macro." (interactive "p") (kmacro-exec-ring-item (quote ("-1o" 0 "%d")) arg)))
(global-set-key (kbd "<C-S-iso-lefttab>") 'other-window-reverse)

(defun delete-window-switch-previous()
  "Delete a window and give focus to the previous window"
  (interactive)
  (call-interactively 'delete-window)
  (call-interactively 'other-window-reverse)
)
(global-set-key (kbd "C-0") 'delete-window-switch-previous)

(defun expand-window()
  "Update current workgroup config, then delete other windows"
  (interactive)
;  (call-interactively 'wg-update-workgroup)
  (delete-other-windows)
)
(global-set-key (kbd "C-1") 'expand-window)

(global-set-key (kbd "C-S-<left>") 'shrink-window-horizontally)
(global-set-key (kbd "C-S-<right>") 'enlarge-window-horizontally)
(global-set-key (kbd "C-S-<down>") 'enlarge-window)
(global-set-key (kbd "C-S-<up>") 'shrink-window)
#+END_SRC
*** Visual (~init-visual.el~)
:PROPERTIES:
:tangle:   init-visual.el
:END:

Divide long logical line into two or more screen lines in ~text~ mode.
#+BEGIN_SRC elisp
(add-hook 'text-mode-hook 'turn-on-visual-line-mode)
#+END_SRC

Turn off potentially distracting things: the scroll bar, menu bar, tool bar, and the blinking of the cursor.
#+BEGIN_SRC elisp
(menu-bar-mode t)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(blink-cursor-mode -1)
#+END_SRC

Turn on potentially useful things: empty line markers, line/column numbers, matching parentheses highlight.
#+BEGIN_SRC elisp
(setq-default indicate-empty-lines t)
(when (not indicate-empty-lines)
  (toggle-indicate-empty-lines))
(line-number-mode 1)
(column-number-mode 1)
(show-paren-mode 1)
#+END_SRC

Use buffer file name as frame title.
#+BEGIN_SRC elisp
(when window-system
  (setq frame-title-format '(buffer-file-name "%f" ("%b"))))
#+END_SRC

Use ~dark-laptop~ color theme, with a ~black~ background and a ~grey90~ foreground.
#+BEGIN_SRC elisp
(add-to-list 'custom-theme-load-path
             (file-name-as-directory "~/.emacs.d/replace-colorthemes"))
(load-theme 'dark-laptop t t)
(enable-theme 'dark-laptop)
(setq default-frame-alist
       `((background-color . "black")
         (foreground-color . "grey90")))
#+END_SRC

Use ~Consolas~ font in Windows, ~DejaVu Sans Mono~ otherwise.
#+BEGIN_SRC elisp
(cond ((eq window-system 'w32)
           (set-face-font 'default "Consolas-16.0:antialias=natural"))
       (t
           (set-face-font 'default "DejaVu Sans Mono-14.0:antialias=natural")))
#+END_SRC

**** Key-bindings
| ~C-x t~ | Toggle truncate lines.|

#+BEGIN_SRC elisp
(setq-default truncate-lines t)
(global-set-key (kbd "C-x t") 'toggle-truncate-lines)
#+END_SRC

*** Text editing (~init-text.el~)
:PROPERTIES:
:tangle:   init-text.el
:END:

Use 4 spaces for tab indentation.
#+BEGIN_SRC elisp
(setq default-tab-width 4)
(setq-default indent-tabs-mode nil)
#+END_SRC

Overwrite selected region when typing after selection.
#+BEGIN_SRC elisp
(pending-delete-mode 1)
#+END_SRC

Set fill-column width to 79 characters.
#+BEGIN_SRC elisp
(setq-default fill-column 79)
#+END_SRC

Provide a ~cleanup-buffer~ function (untabify + indent + remove trailing whitespaces).
#+BEGIN_SRC elisp
(defun untabify-buffer ()
  (interactive)
  (untabify (point-min) (point-max)))
(defun indent-buffer ()
  (interactive)
  (indent-region (point-min) (point-max)))
(defun cleanup-buffer ()
  "Perform a bunch of operations on the whitespace content of a buffer."
  (interactive)
  (indent-buffer)
  (untabify-buffer)
  (delete-trailing-whitespace))
#+END_SRC

Provide convenient hooks for programming modes (e.g. for GAMS and python) to automatically untabify and set utf-8-unix coding system before saving.
#+BEGIN_SRC elisp
(defun progmodes-hooks ()
  "Hooks for programming modes"
  (yas/minor-mode-on)
  (add-hook 'before-save-hook 'progmodes-write-hooks))
(defun progmodes-write-hooks ()
  "Hooks which run on file write for programming modes"
  (prog1 nil
    (set-buffer-file-coding-system 'utf-8-unix)
    (untabify-buffer)))
#+END_SRC

Enable disabled commands.
#+BEGIN_SRC elisp
(put 'erase-buffer 'disabled nil)
#+END_SRC

**** Key-bindings
| ~C-x C-a~          | Copy whole buffer.                              |
| ~C-z~              | Copy current line.                              |
| ~C-S-z~            | Clone previous line.                            |
| ~C-M-j~            | Copy a symbolic expression.                     |
| ~C-x n n, C-x n w~ | Restrict editing to region.                     |
| ~C-x C-u~          | Convert region to upper case.                   |
| ~C-x C-l~          | Convert region to lower case                    |

#+BEGIN_SRC elisp
(defun copy-whole-buffer ()
  "Copy entire buffer to clipboard"
  (interactive)
  (clipboard-kill-ring-save (point-min) (point-max)))
(global-set-key (kbd "C-x C-a")  'copy-whole-buffer)

(fset 'copy-line
   "\C-a\C-k\C-y")
(global-set-key (kbd "C-z")  'copy-line)

(fset 'clone-previous-line
   [up ?\C-a ?\C-k ?\C-y down ?\C-a ?\C-y ?\C-a])
(global-set-key (kbd "C-S-z")  'clone-previous-line)

(fset 'copy-sexp
   [?\C-  C-M-right escape ?w C-M-left])
(global-set-key (kbd "C-M-j")  'copy-sexp)

(put 'narrow-to-region 'disabled nil)
(put 'upcase-region 'disabled nil)
(put 'downcase-region 'disabled nil)
#+END_SRC

** Customizing add-on features
*** The loader (~init-packages.el~)
:PROPERTIES:
:tangle:   init-packages.el
:END:

Packages defined in ~package-list~ (~init.el~) are automatically installed from MELPA/gnu repositories if missing, and their respective configuration file ~init-mod-${PACKAGE_NAME}.el~ loaded.

#+BEGIN_SRC elisp
(setq package-archives '(("gnu" . "http://elpa.gnu.org/packages/")
                         ("melpa" . "http://melpa.milkbox.net/packages/")))

(package-initialize)

(unless package-archive-contents
  (package-refresh-contents))

(require 'cl)
(defun package-list-installed-p ()
  (loop for package in package-list
        when (not (package-installed-p package)) do (return nil)
        finally (return t)))

(unless (package-list-installed-p)
  (message "%s" "Emacs is now refreshing its package database...")
  (package-refresh-contents)
  (message "%s" " done."))
(dolist (package package-list)
  (unless (package-installed-p package)
    (package-install package))
  (load-library (format "init-mod-%s.el" package)))
#+END_SRC

Entries defined in ~other-package-list~ (~init.el~) are the names of subfolders to be included in ~load-path~, referring to packages outside the repository-based system above. Their respective configuration file ~init-mod-${SUBFOLDER_NAME}.el~ is also loaded.
#+BEGIN_SRC elisp
(dolist (package other-package-list)
  (add-to-list 'load-path (format "~/.emacs.d/%s" package))
  (load-library (format "init-mod-%s.el" package)))
#+END_SRC
* To be cleaned 
** OS integration configuration (~init-os.el~)

- ~open-folder-in-explorer~ opens folder of the buffer file either in Windows
  Explorer or nautilus.
- ~open-cmd-at-folder~ opens a command line (Windows or gnome) at the folder of
  the buffer file.
- ~view-buffer-in-firefox~ opens the buffer file in Firefox.

** Python (~init-python.el~)
:PROPERTIES:
:tangle:   init-python.el
:END:
Use the ~ipython~ interpreter with no arguments.
#+BEGIN_SRC elisp
(setq python-shell-interpreter "ipython")
(setq python-shell-interpreter-args "")
#+END_SRC

Set regular expressions matching the input and output prompt of the ipython shell.
#+BEGIN_SRC elisp
(setq python-shell-prompt-regexp "In \\[[0-9]+\\]: ")
(setq python-shell-prompt-output-regexp "Out\\[[0-9]+\\]: ")
#+END_SRC

Activate auto-completion support.
#+BEGIN_SRC elisp
(setq python-shell-completion-setup-code "from IPython.core.completerlib import module_completion")
(setq python-shell-completion-module-string-code "';'.join(module_completion('''%s'''))\n")
(setq python-shell-completion-string-code "';'.join(get_ipython().Completer.all_completions('''%s'''))\n")
#+END_SRC

** MATLAB (~init-matlab.el~)
:PROPERTIES:
:tangle:   init-matlab.el
:END:
#+BEGIN_SRC elisp
  (autoload 'matlab-mode "matlab" "Matlab Editing Mode" t)
  (add-to-list
   'auto-mode-alist
   '("\\.m$" . matlab-mode))
  (setq matlab-indent-function t)
  (setq matlab-shell-command "/usr/local/bin/matlab --nodesktop")
#+END_SRC
