README.org
** LaTeX (~init-latex.el~)
:PROPERTIES:
:tangle:   init-latex.el
:END:

~C-c C-c~ to run LaTeX over your document. Once it has compiled correctly, ~C-c C-c~ again to view it, or if it failed to compile ~C-c `~ to see the errors.

When you have a "master" file including other files with the TeX macro "\input" or the LaTeX macro "\include", to format the document you must run the commands on the top level master file. Assume the current file is a master file itself.
#+BEGIN_SRC elisp
(setq-default TeX-master t)
#+END_SRC

If ~TeX-master~ is set to ~nil~, you will be queried for a master file unless the following text is present at the end of your files.
#+BEGIN_EXAMPLE
%%% Local Variables:
%%% TeX-master: "master"
%%% End:
#+END_EXAMPLE

Enable parsing of buffers at save and load events for extracting meta information, which will be stored in an ~auto~ subdirectory.
#+BEGIN_SRC elisp
(setq TeX-auto-save t)
(setq TeX-parse-self t)
#+END_SRC

Activate some useful hooks.
#+BEGIN_SRC elisp
(add-hook 'LaTeX-mode-hook 'visual-line-mode)
(add-hook 'LaTeX-mode-hook 'flyspell-mode)
(add-hook 'LaTeX-mode-hook 'LaTeX-math-mode)
#+END_SRC

Configure reftex.
#+BEGIN_SRC elisp
(add-hook 'LaTeX-mode-hook 'turn-on-reftex)
(setq reftex-plug-into-AUCTeX t)
(setq reftex-default-bibliography 
(quote
("~/org/jacklibrary.bib"))) 
#+END_SRC
** Modules
*** helm (~init-mod-helm.el~)

- helm configuration:
  - show buffers list, recent files, files in current dir, and moccur
  - don't use locate under Windows (I haven't been able to find something that doesn't freeze
    up my system)
- helm replacements for common things:
  - ~M-x~ uses helm version
  - ~M-y~ shows kill ring
  - ~Ctrl-h SPC~ shows all mark rings
- helm navigation between buffers and files:
  - ~Ctrl-`~ looks for and opens buffer
  - ~Ctrl-M-`~ looks for and go to semantic section
  - ~Ctrl-\~~ looks for and opens file
  - ~Ctrl-2~ splits window vertically, then switches to buffer in other window
  - ~Ctrl-@~ splits window vertically, then finds file in other window
  - ~Ctrl-3~ splits window horizontally, then switches to buffer in other window
  - ~Ctrl-#~ splits window horizontally, then finds file in other window
  - ~Ctrl-4~ switches to buffer in other window
  - ~Ctrl-$~ finds file in other window
  - ~Ctrl-5~ switches to buffer in other window in reverse order
  - ~Ctrl-%~ finds file in other window

*** yasnippet (~init-mod-yasnippet.el~)

-

*** expand-region (~init-mod-expand-region.el~)
#+BEGIN_SRC elisp
(require 'expand-region)
#+END_SRC

Customize the list of functions that are tried when expanding depending on current mode.


**** Key-bindings
| ~C-=~ | Expand region.                                  |
| ~C-+~ | Contract region.                                |
| ~C-\~ | Copy section around keeping cursor in position. |

#+BEGIN_SRC elisp
(global-set-key (kbd "C-=") 'er/expand-region)
(global-set-key (kbd "C-+") 'er/contract-region)

(fset 'copy-section-around-keeping-cursor-position
   (lambda (&optional arg) "Keyboard macro." (interactive "p") (kmacro-exec-ring-item (quote ([C-f1 67108925 134217847 C-f2] 0 "%d")) arg)))
(global-set-key (kbd "C-\\") 'copy-section-around-keeping-cursor-position)
#+END_SRC
*** Visible Bookmarks (~init-mod-bm.el~)
:PROPERTIES:
:tangle:   init-mod-bm.el
:END:
#+BEGIN_SRC elisp
(require 'bm)
#+END_SRC

Navigate bookmarks with assigned keys.
#+BEGIN_SRC elisp
(global-set-key (kbd "<C-f1>") 'bm-toggle)
(global-set-key (kbd "<C-f2>")   'bm-next)
(global-set-key (kbd "<C-f3>") 'bm-previous)
#+END_SRC

Click on fringe to toggle bookmarks, and use mouse wheel to move between them.
#+BEGIN_SRC elisp
(global-set-key (kbd "<left-fringe> <mouse-5>") 'bm-next-mouse)
(global-set-key (kbd "<left-fringe> <mouse-4>") 'bm-previous-mouse)
(global-set-key (kbd "<left-fringe> <mouse-1>") 'bm-toggle-mouse)
#+END_SRC

Cycle bookmark in LIFO order.
#+BEGIN_SRC elisp
(setq bm-in-lifo-order t)
#+END_SRC

Cycle through bookmarks in all open buffers.
#+BEGIN_SRC 
(setq bm-cycle-all-buffers t)
#+END_SRC

Remove bookmark after jump to it by ~bm-next~ or ~bm-previous~.
#+BEGIN_SRC elisp
(setq temporary-bookmark-p t)
#+END_SRC

*** org-mode (~init-mod-org.el~)
:PROPERTIES:
:tangle:   init-mod-org.el
:END:
Org is a mode for keeping notes, maintaining TODO lists, and doing
project planning with a fast and effective plain-text system.

**** General
Load the relevant packages.
#+BEGIN_SRC elisp
(require 'org)
(require 'org-habit)
#+END_SRC
Use org as the default mode for .org, .org_archive, and .txt files.
#+BEGIN_SRC elisp
(add-to-list 'auto-mode-alist '("\\.\\(org\\|org_archive\\|txt\\)$" . org-mode))
#+END_SRC


Single keys can be made to execute commands when the cursor is at the
beginning of a headline, speeding up the navigation.
#+BEGIN_SRC elisp
(setq org-use-speed-commands t)
#+END_SRC

Provide some convenient rebindings.
#+BEGIN_SRC elisp
(defun custom-org-mode-defaults ()
"Executed as org-mode-hook."
(electric-indent-mode -1)
(org-defkey org-mode-map (kbd "M-p") 'org-metaup)
(org-defkey org-mode-map (kbd "M-n") 'org-metadown)
(org-defkey org-mode-map (kbd "C-p") 'org-babel-previous-src-block)
(org-defkey org-mode-map (kbd "C-n") 'org-babel-next-src-block)
(org-defkey org-mode-map (kbd "<prior>") 'org-previous-link)
(org-defkey org-mode-map (kbd "<next>") 'org-next-link)
(org-shifttab 2))
(add-hook 'org-mode-hook 'custom-org-mode-defaults)
#+END_SRC
Speed keys ~n~ and ~p~ are rebind to a tidier view of next/previous entries.
#+BEGIN_SRC elisp
(defun ded/org-show-next-heading-tidily ()
  "Show next entry, keeping other entries closed."
  (if (save-excursion (end-of-line) (outline-invisible-p))
      (progn (org-show-entry) (show-children))
    (outline-next-heading)
    (unless (and (bolp) (org-on-heading-p))
      (org-up-heading-safe)
      (hide-subtree)
      (error "Boundary reached"))
    (org-overview)
    (org-reveal t)
    (org-show-entry)
    (show-children)))
(add-to-list 'org-speed-commands-user
             '("n" ded/org-show-next-heading-tidily))
(defun ded/org-show-previous-heading-tidily ()
  "Show previous entry, keeping other entries closed."
  (let ((pos (point)))
    (outline-previous-heading)
    (unless (and (< (point) pos) (bolp) (org-on-heading-p))
      (goto-char pos)
      (hide-subtree)
      (error "Boundary reached"))
    (org-overview)
    (org-reveal t)
    (org-show-entry)
    (show-children)))
(add-to-list 'org-speed-commands-user 
             '("p" ded/org-show-previous-heading-tidily))
#+END_SRC
**** Tasks
Add a time stamp to the task when moved to DONE.
#+BEGIN_SRC elisp
(setq org-log-done 'time)
#+END_SRC

Set the default workflow keywords (~C-c C-t~ to choose) and their faces.
#+BEGIN_SRC elisp
(setq org-todo-keywords
      '((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!/!)")
        (sequence "WAITING(w@/!)" "HOLD(h@/!)" "SOMEDAY(o)" "|" "CANCELLED(c@/!)")))

(setq org-todo-keyword-faces
      '(("TODO"      :foreground "red"     :weight bold)
        ("NEXT"      :foreground "#e9c062" :weight bold) ; "blue"?
        ("DONE"      :foreground "forest green" :weight bold)
        ("WAITING"   :foreground "#fd9b3b" :weight bold)
        ("HOLD"      :foreground "#9b859d" :weight bold)
        ("SOMEDAY"   :foreground "#808080" :weight bold)
        ("CANCELLED" :foreground "#9eb9a7" :weight bold)))
#+END_SRC

